Repository: devkhon/quizbot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uz

source: 👋 Hello\! I\'m here to help you create quizzes for your channels\. Use /addquiz to begin\.
ru: 👋 Привет\! Я помогу вам создать викторины для ваших каналов\. Используйте /addquiz, чтобы начать\.
uz: 👋 Salom\! Men sizga kanallaringiz uchun viktorinalar yaratishda yordam beraman\. Boshlash uchun /addquiz buyrug'ini yuboring\.

source: ⚠️ You don\'t have any channels where I\'m an admin\. Please add me as an *admin* to your channel and try again\.
ru: ⚠️ У вас нет каналов, где я являюсь администратором\. Пожалуйста, добавьте меня как *администратора* в ваш канал и попробуйте снова\.
uz: ⚠️ Men administrator bo'lgan hech qanday kanalingiz yo'q\. Iltimos, meni kanalingizga *administrator* sifatida qo‘shing va qayta urinib ko‘ring\.

source: ❌ Cancel
ru: ❌ Отмена
uz: ❌ Bekor qilish

source: 📢 Select a channel to post your quiz in:
ru: 📢 Выберите канал для публикации викторины:
uz: 📢 Viktorinani qaysi kanalga joylashtirishni tanlang:

source: ↩️ Back
ru: ↩️ Назад
uz: ↩️ Orqaga

source: ❓What\'s the quiz question?
ru: ❓Какой вопрос викторины?
uz: ❓Viktorina savoli qanday?

source: ❗The question is too long\. Please limit it to *300 characters or fewer*
ru: ❗Вопрос слишком длинный\. Пожалуйста, ограничьтесь *300 символами или меньше*
uz: ❗Savol juda uzun\. Iltimos, uni *300 ta belgidan kamroq* qilib cheklang\.

source: ✏️ Send me one possible answer:
ru: ✏️ Отправьте один из вариантов ответа:
uz: ✏️ Iltimos, bitta mumkin bo‘lgan javobni yuboring:

source: ❗The option is too long\. Please limit it to *100 characters or fewer*
ru: ❗Вариант слишком длинный\. Пожалуйста, ограничьтесь *100 символами или меньше*
uz: ❗Variant juda uzun\. Iltimos, uni *100 ta belgidan kamroq* qilib cheklang\.

source: 🎯 Done
ru: 🎯 Готово
uz: 🎯 Tayyor

source: ⚠️ Add at *least 2 options* before finishing\.
ru: ⚠️ Добавьте *как минимум 2 варианта*, прежде чем завершить\.
uz: ⚠️ Tugatishdan oldin *kamida 2 ta variant* qo‘shing\.

source: ✅ Pick the correct answer from the list below:
ru: ✅ Выберите правильный ответ из списка ниже:
uz: ✅ Quyidagi ro‘yxatdan to‘g‘ri javobni tanlang:

source: 🚫 You\'ve reached the *maximum of 10* options\.
ru: 🚫 Вы достигли *максимума в 10* вариантов\.
uz: 🚫 Siz *10 ta* variant limitiga yetdingiz\.

source: ✅ Option added\! Send another one\.
ru: ✅ Вариант добавлен\! Отправьте ещё один\.
uz: ✅ Variant qo‘shildi\! Yana birini yuboring\.

source: ❗Invalid response\. Please use one of the provided buttons\.
ru: ❗Неверный ответ\. Пожалуйста, используйте одну из предложенных кнопок\.
uz: ❗Noto‘g‘ri javob\. Iltimos, taklif etilgan tugmalardan birini tanlang\.

source: ⏭️ Skip
ru: ⏭️ Пропустить
uz: ⏭️ O‘tkazib yuborish

source: 💬 Send an explanation for this quiz \(or tap {skip_btn}\)\.
ru: 💬 Отправьте объяснение к этой викторине \(или нажмите {skip_btn}\)\.
uz: 💬 Ushbu viktorina uchun tushuntirish yuboring \(yoki {skip_btn} tugmasini bosing\)\.

source: ❗The explanation is too long\. Please limit it to *200 characters or fewer*
ru: ❗Объяснение слишком длинное\. Пожалуйста, ограничьтесь *200 символами или меньше*
uz: ❗Tushuntirish juda uzun\. Iltimos, uni *200 ta belgidan kamroq* qilib cheklang\.

source: ✅ Approve
ru: ✅ Одобрить
uz: ✅ Tasdiqlash

source: 🗑️ Reject
ru: 🗑️ Отклонить
uz: 🗑️ Rad etish

source: 📝 *Quiz Preview* 📢 *Channel*: {channel} ❓ *Question*: {question} 🔢 *Options*: {options} ✅ *Correct*: {correct} ℹ️ *Explanation*: {explanation} Do you want to approve this quiz\?
ru: 📝 *Предпросмотр викторины* 📢 *Канал*: {channel} ❓ *Вопрос*: {question} 🔢 *Варианты*: {options} ✅ *Правильный*: {correct} ℹ️ *Объяснение*: {explanation} Вы хотите одобрить эту викторину\?
uz: 📝 *Viktorina oldindan ko‘rish* 📢 *Kanal*: {channel} ❓ *Savol*: {question} 🔢 *Variantlar*: {options} ✅ *To‘g‘ri javob*: {correct} ℹ️ *Tushuntirish*: {explanation} Ushbu viktorinani tasdiqlaysizmi\?

source: 🗑️ Quiz creation rejected\.
ru: 🗑️ Создание викторины отклонено\.
uz: 🗑️ Viktorina yaratish rad etildi\.

source: 🎉 Quiz saved\!
ru: 🎉 Викторина сохранена\!
uz: 🎉 Viktorina saqlandi\!

source: 🚫 Quiz creation canceled\.
ru: 🚫 Создание викторины отменено\.
uz: 🚫 Viktorina yaratish bekor qilindi\.

source: 🕒 Time
ru: 📚 Викторины
uz: 🕒 Vaqt

source: 📚 Quizzes
uz: 📚 Viktorinalar

source: ⚙️ Choose what to configure:
ru: ⚙️ Выберите, что настроить:
uz: ⚙️ Qaysi sozlamani o‘zgartirmoqchisiz?

source: ⏰ Enter time in *HH:MM* format:
ru: ⏰ Введите время в формате *ЧЧ:ММ*:
uz: ⏰ Vaqtni *SS:MM* formatida kiriting:

source: 🔢 Enter number of quizzes to send:
ru: 🔢 Введите количество викторин для отправки:
uz: 🔢 Yuboriladigan viktorinalar sonini kiriting:

source: ❓ Set time to *{time}*?
ru: ❓ Установить время на *{time}*?
uz: ❓ Vaqtni *{time}* ga sozlaysizmi?

source: ❗ Invalid format\. Use *HH:MM*
ru: ❗ Неверный формат\. Используйте *ЧЧ:ММ*
uz: ❗ Noto‘g‘ri format\. *SS:MM* formatidan foydalaning

source: ❓ Set quiz count to *{count}*?
ru: ❓ Установить количество викторин на *{count}*?
uz: ❓ Viktorinalar sonini *{count}* ga o‘rnatilsinmi?

source: ❗ Please enter a *positive number*
ru: ❗ Пожалуйста, введите *положительное число*
uz: ❗ Iltimos, *musbat son* kiriting

source: 🔁 Re\-enter time:
ru: 🔁 Введите время повторно:
uz: 🔁 Vaqtni qaytadan kiriting:

source: 🔁 Re\-enter quiz count:
ru: 🔁 Введите количество повторно:
uz: 🔁 Viktorinalar sonini qaytadan kiriting:

source: 🗑️ Settings rejected\. Choose again:
ru: 🗑️ Настройки отклонены\. Выберите снова:
uz: 🗑️ Sozlamalar bekor qilindi\. Yana tanlang:

source: ✅ Settings saved\! Choose next action:
ru: ✅ Настройки сохранены\! Выберите следующее действие:
uz: ✅ Sozlamalar saqlandi\! Keyingi amalni tanlang:

source: 🚫 Settings configuration canceled\.
ru: 🚫 Настройка отменена\.
uz: 🚫 Sozlamalarni o‘zgartirish bekor qilindi\.
